Тест_ЗУП_31_КОРП/src/Documents/ХодатайствоОБронированииГражданПребывающихВЗапасе/ХодатайствоОБронированииГражданПребывающихВЗапасе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХодатайствоОБронированииГражданПребывающихВЗапасе</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Звание</name>
      <type>
        <types>CatalogRef.ЗванияГражданскогоВоинскогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Состав</name>
      <type>
        <types>CatalogRef.СоставыВоеннослужащих</types>
      </type>
    </attributes>
    <attributes>
      <name>ВУС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Годность</name>
      <type>
        <types>EnumRef.ГодностьКВоеннойСлужбе</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеМобпредписания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКомандыПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктПеречня</name>
      <type>
        <types>CatalogRef.ПереченьДолжностейДляБронированияГраждан</types>
      </type>
    </attributes>
    <attributes>
      <name>МотивХодатайства</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеВоинскогоУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиФикс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Documents/ХодатайствоОБронированииГражданПребывающихВЗапасе/Forms/РедактированиеДанныхВоинскогоУчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ВоинскийУчет);
	Заголовок = Строка(ФизическоеЛицо);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВоинскийУчет = Новый Структура("ФизическоеЛицо, Звание, Состав, ВУС, Годность, НаличиеМобпредписания, НомерКомандыПартии");
	ЗаполнитьЗначенияСвойств(ВоинскийУчет, ЭтотОбъект);
	Оповестить("ИзмененыДанныеВоинскогоУчета", ВоинскийУчет, ЭтотОбъект.ВладелецФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть();
	
КонецПроцедуры

#КонецОбласти
